/* ========================================================================
 * 파일명 : exercise1.c
 * ----------------------------------------
 * 학부 : 이화여자대학교
 *        휴먼기계바이오공학부
 * 학번 : 2270090
 * 성명 : 최희나 (ellachoi@ewhain.net)
 * 설명 :
 *        두 소스코드가 동일하게 빈칸을 채우시오(포인터 이용)
 * 이력 :
 *        2022-11-24 : 최초 작성 (최희나)
 * ====================================================================== */
#define _CRT_SECURE_NO_WARNINGS  // for visual studio
#include <stdio.h>

 /* ========================================================================
  * 함수명 : diff
  * 함수설명 :
  *          2개의 캐릭터값의 차이
  * 리턴값 : [int] diff 값
  * 매개변수 :
  *          [char *pa] - first charater pointer
  *          [char *pb] - second charater pointer
  * HISTORY :
  *          2022-11-24 : 최초 작성 (최희나)
  * ====================================================================== */
int diff(char* pa, char* pb)
{
	if (*pa > *pb)
		return (*pa - *pb);
	else
		return (*pb - *pa);
}


int main()
{
	char ch1, ch2;

	printf("두 문자를 입력: ");
	scanf("%c %c", &ch1, &ch2);

	printf("두 문자의 차이 ==> %d\n", diff(&ch1, &ch2));

	return 0;
}
