/* ========================================================================
 * 파일명 : exercise1.c
 * ----------------------------------------
 * 학부 : 이화여자대학교
 *		  휴먼기계바이오공학부
 * 학번 : 2270090
 * 성명 : 최희나 (ellachoi@ewhain.net)
 * 설명 :
 *		배열의 가장 작은값을 출력
 * 이력 :
 *		2022-11-02 : 최초 작성 (최희나)
 * ====================================================================== */
#define _CRT_SECURE_NO_WARNINGS  // for visual studio
#include <stdio.h>

int main()
{
	int a[] = { 10, 20, 30, 40, 50, 60, 70, 80, 90, 100 };

	int min = a[0]; // 채울것 (1)

	for (int i = 0; i < sizeof(a) / sizeof(a[0]); i++) {
		if (a[i] < min) min = a[i];  // 채울것 (2)
	}

	printf("배열의 최소값: %d\n", min);

	return 0;
}