/* ========================================================================
 * 파일명 : exercise2.c
 * ----------------------------------------
 * 학부 : 이화여자대학교
 *		  휴먼기계바이오공학부
 * 학번 : 2270090
 * 성명 : 최희나 (ellachoi@ewhain.net)
 * 설명 :
 *		2차원배열을 토대로 각각의 성적과 총점, 평균을 출력하라
 *
 * 이력 :
 *		2022-10-26 : 최초 작성 (최희나)
 * ====================================================================== */
#define _CRT_SECURE_NO_WARNINGS  // for visual studio
#include <stdio.h>

int main()
{
	int jum[5][7] = {
		{1,80,90,90},
		{2,88,76,90},
		{3,89,78,86},
		{4,70,80,90},
		{5,30,68,84}
	};

	char name[5][10] = {
		{"김이화"},
		{"이이화"},
		{"박이화"},
		{"홍이화"},
		{"윤이화"}
	};

	// step 1: 총점과 평균을 구해서 jum에 입력

	int i, j, sum = 0;

	for (i = 0; i < 5; i++) {
		for (j = 1; j < 4; j++) {
			sum += jum[i][j];
		}
		jum[i][4] = sum;
		jum[i][5] = sum / 3;
		sum = 0;
	}

	// step 2: jum과 name배열을 이용해서 출력
	printf("번호 이름   국어 영어 수학 총점 평균\n");
	printf("====================================\n");

	for (i = 0; i < 5; i++) {
		for (j = 0; j < 6; j++) {
			if (j == 0)
				printf("%d", jum[i][j]);
			else if (j == 1)
				printf("%10s %3d ", name[i], jum[i][j]);
			else
				printf("%4d ", jum[i][j]);
		}
		printf("\n");
	}
	printf("====================================\n");

	return 0;
}